loadtest/user-files/data/Update20_GCC.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:itintegration:engagementindex:UpdateResponder:1" xmlns:urn2="urn:riv:itintegration:engagementindex:1">
   <soapenv:Header>
      <urn:LogicalAddress>${logicalAddress}</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:Update>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK01</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK01</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK02</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK02</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK03</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK03</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK04</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK04</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK05</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK05</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK06</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK06</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK07</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK07</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK08</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK08</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK09</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK09</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK10</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK10</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK11</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK11</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK12</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK12</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK13</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK13</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK14</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK14</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK15</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK15</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK16</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK16</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK17</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK17</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK18</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK18</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK19</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK19</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
         <urn1:engagementTransaction>
            <urn2:deleteFlag>${delete}</urn2:deleteFlag>
            <urn2:engagement>
               <urn2:registeredResidentIdentification>${patientId1}</urn2:registeredResidentIdentification>
               <urn2:serviceDomain>riv:clinicalprocess:logistics:logistics</urn2:serviceDomain>
               <urn2:categorization>vko</urn2:categorization>
               <urn2:logicalAddress>SKLTP-MOCK20</urn2:logicalAddress>
               <urn2:businessObjectInstanceIdentifier>NA</urn2:businessObjectInstanceIdentifier>
               <urn2:clinicalProcessInterestId>NA</urn2:clinicalProcessInterestId>
               <urn2:mostRecentContent>20190325152412</urn2:mostRecentContent>
               <urn2:sourceSystem>SKLTP-MOCK20</urn2:sourceSystem>
               <urn2:dataController>SE-NMT123</urn2:dataController>
            </urn2:engagement>
         </urn1:engagementTransaction>
      </urn1:Update>
   </soapenv:Body>
</soapenv:Envelope>
